app/controllers/posts_controller.rb

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("contacts", "created_at", "fdate", "fplace", "info", "pet_name", "photo", "status", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)